task4/Case folder/Re50/Re50_selected_mesh(1000_160)/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            wall;
        inGroups        1(wall);
        nFaces          160;
        startFace       314136;
    }
    outlet
    {
        type            wall;
        inGroups        1(wall);
        nFaces          160;
        startFace       314296;
    }
    top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1000;
        startFace       314456;
    }
    bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1000;
        startFace       315456;
    }
    cylinder
    {
        type            wall;
        inGroups        1(wall);
        nFaces          192;
        startFace       316456;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          315392;
        startFace       316648;
    }
)

// ************************************************************************* //
